package collection.set;

public class SetExample {
    public static void main(String[] args) {

/*
        ConcurrentHashMap.newKeySet()

Set<E> set = ConcurrentHashMap.newKeySet();
Универсальный выбор для большинства задач с высокой конкуренцией.
Лучшая масштабируемость и производительность в большинстве случаев.
(Высокая скорость чтения и записи. size() может быть неточным.)
----------------------------------------------------------------------
        Collections.newSetFromMap()

Set<E> set = Collections.newSetFromMap(new ConcurrentHashMap<E, Boolean>());
Практически идентичен newKeySet(), особенно до Java 8.
Семантика ConcurrentHashMap.
(Хороший вариант, если нужна совместимость со старыми версиями Java.)
----------------------------------------------------------------------
            CopyOnWriteArraySet

Set<E> set = new CopyOnWriteArraySet<>();
Чтение значительно преобладает над записью, а коллекция небольшая.
Чтение без блокировок. Итераторы не бросают ConcurrentModificationException.
(Очень дорогая запись, так как копируется весь массив.)
----------------------------------------------------------------------
            ConcurrentSkipListSet

Set<E> set = new ConcurrentSkipListSet<>();
Нужен отсортированный потокобезопасный Set.
Элементы отсортированы. Операции add, remove, contains имеют сложность O(log n).
(Хорошая альтернатива для больших наборов данных с частыми изменениями.)
----------------------------------------------------------------------
            Collections.synchronizedSet()

Set<E> set = Collections.synchronizedSet(new HashSet<>());
Низкая конкуренция или простые задачи, где производительность не критична.
Простота. Но это просто обертка с блокировкой на каждый вызов,
что создает высокую конкуренцию и плохо масштабируется.
(Итерация требует внешней синхронизации.)
 */

    }
}
