
ROUND()

--------------------------------------------------------------------------------------

                                    ROUND()

SELECT ROUND(123.456);                -- Результат: 123 (до целого)
SELECT ROUND(123.456, 2);             -- Результат: 123.46 (до 2 знаков)
SELECT ROUND(-123.456, 1);            -- Результат: -123.5 (отрицательное число)
SELECT ROUND(12345.678, -2);          -- Результат: 12300 (округление до сотен)
SELECT ROUND(2.4);                    -- Результат: 2
SELECT ROUND(2.5);                    -- Результат: 3 (для numeric)

SELECT ROUND(2.5::double precision);  -- 2: округляются к ближайшему чётному
SELECT ROUND(3.5::double precision);  -- 4: округляются к ближайшему чётному

-- CEIL	    -  Округляет вверх до ближайшего целого.
-- FLOOR    -  Округляет вниз до ближайшего целого.
-- TRUNC    -  Обрезает число, не производя округления. 

--         ROUND  FLOOR  CEIL  TRUNC
--  2.1  →   2      2      3     2
--  2.5  →   3      2      3     2
--  2.9  →   3      2      3     2
-- -2.1  →  -2     -3     -2    -2
-- -2.5  →  -3     -3     -2    -2
-- -2.9  →  -3     -3     -2    -2

--------------------------------------------------------------------------------------

